clear
clc

%输入参数
Ma=1203;   %总负载扭矩
L=1300;    %抽油杆长度
miu=730;    %粘度
m=0.7;      %制动扭矩倍数
for i=1:100
[t]=ZhiDongShiJian(L,m);
[v]=ZhiDongSuDu(L,m,miu);
[M_re]=NiuJu(m,Ma);
mm(i)=m;           %制动扭矩倍数
Mt(i)=Ma*m;      %制动扭矩
tt(i)=t;        %制动时间
vv(i)=v;        %反转速度
MM_re(i)=M_re;   %残余扭矩
Ma=M_re;         %残余扭矩
miu=miu*m;
if M_re<=10
    break
end
end
tt3=sum(tt);
vv3=vv(1);
disp(['总制动时间为: ', num2str(tt3),' s']);
disp(['最大反转速度为: ', num2str(vv3),' rad/s']);
% 输出表头
fprintf('制动扭矩倍数  制动扭矩(N·m)  反转时间(s)  反转速度(rad/s) 残余扭矩（N·m）\n');

% 输出数据，使用格式化字符串
for i = 1:length(mm)
    fprintf('%12.2d  %-14.2f  %-10.2f  %-12.2f  %-10.2f\n', ...
        mm(i), Mt(i), tt(i), vv(i), MM_re(i));
end

function [t]=ZhiDongShiJian(L,m)
t1=5.81242*exp(-m/0.22487)+0.94096;     %500m
t2=10.54432*exp(-m/0.21419)+1.81065;     %900m
t3=18.28527*exp(-m/0.21007)+2.68065;     %1300m
t4=23.62921*exp(-m/0.20535)+4.23604;     %2000m
t5=35.01277*exp(-m/0.21332)+6.15615;     %3000m
if L<=500
    t=t1;
elseif L<=900
    t=t1+(t2-t1)/(900-500)*(L-500);
elseif L<=1300
    t=t2+(t3-t2)/(1300-900)*(L-900);
elseif L<=2000
    t=t3+(t4-t3)/(2000-1300)*(L-1300);
elseif L<=3000
    t=t4+(t5-t4)/(3000-2000)*(L-2000);
else 
    t=t5;
end
end
function [v]=ZhiDongSuDu(L,m,miu)

%50mPas-500m-900m-1300m-2000m-3000m
v11=11.2236-11.038*m;
v12=12.3301-12.126*m;
v13=13.4365-13.214*m;
v14=15.3727-15.118*m;
v15=18.1611-17.849*m;

%100mPas-500m-900m-1300m-2000m-3000m
v21=12.6067-12.3982*m;
v22=14.8195-14.5746*m;
v23=17.0324-16.751*m;
v24=20.9049-20.5597*m;
v25=26.4694-26.0151*m;

%200mPas-500m-900m-1300m-2000m-3000m
v31=15.3727-15.118*m;
v32=19.7984-19.471*m;
v33=24.224-23.824*m;
v34=31.8377-30.870*m;
v35=42.233-41.968*m;

%400mPas-500m-900m-1300m-2000m-3000m
v41=20.9664-20.759*m;
v42=29.8437-29.5492*m;
v43=38.7209-38.3388*m;
v44=54.0977-53.2056*m;
v45=76.3194-75.0109*m;

%730mPas-500m-900m-1300m-2000m-3000m
v51=30.03295-29.53743*m;
v52=46.18677-45.42503*m;
v53=62.34062-61.3127*m;
v54=90.60984-89.11613*m;
v55=130.99444-128.8353*m;

%1000mPas-500m-900m-1300m-2000m-3000m
v61=37.50132-36.8826*m;
v62=59.62987-58.6466*m;
v63=81.75842-80.4105*m;
v64=120.4833-118.497*m;
v65=175.8047-172.907*m;

if miu<=50
    if L<=500
        v=v11;
    elseif L<=900
        v=v11+(v12-v11)/(900-500)*(L-500);
    elseif L<=1300
        v=v12+(v13-v12)/(900-1300)*(L-1300);
    elseif L<=2000
        v=v13+(v14-v13)/(2000-1300)*(L-1300);
    elseif L<=3000
        v=v14+(v15-v14)/(3000-2000)*(L-2000);
    else 
        v=v15;
    end
end
    
if miu>50&&miu<=100
    if L<=500
        v01=v11;
        v02=v21;
        v=min(v01,v02)+abs(v01-v02)*(miu-50)/(100-50);
    elseif L<=900
        v01=min(v11,v12)+abs(v11-v12)/(900-500)*(L-500);
        v02=min(v21,v22)+abs(v21-v22)/(900-500)*(L-500);
        v=min(v01,v02)+abs(v01-v02)*(miu-50)/(100-50);
    elseif L<=1300
        v01=min(v12,v13)+abs(v12-v13)/(1300-900)*(L-900);
        v02=min(v22,v23)+abs(v22-v23)/(1300-900)*(L-900);
        v=min(v01,v02)+abs(v01-v02)*(miu-50)/(100-50);
    elseif L<=2000
        v01=min(v13,v14)+abs(v13-v14)/(2000-1300)*(L-1300);
        v02=min(v23,v24)+abs(v23-v24)/(2000-1300)*(L-1300);
        v=min(v01,v02)+abs(v01-v02)*(miu-50)/(100-50);      
    elseif L<=3000
        v01=min(v14,v15)+abs(v14-v15)/(3000-2000)*(L-2000);
        v02=min(v24,v25)+abs(v24-v25)/(3000-2000)*(L-2000);
        v=min(v01,v02)+abs(v01-v02)*(miu-50)/(100-50);  
    else
        v01=v15;
        v02=v25;
        v=min(v01,v02)+abs(v01-v02)*(miu-50)/(100-50);
    end
end
if miu>100&&miu<=200
    if L<=500
        v01=v21;
        v02=v31;
        v=min(v01,v02)+abs(v01-v02)*(miu-100)/(200-100);
    elseif L<=900
        v01=min(v21,v22)+abs(v21-v22)/(900-500)*(L-500);
        v02=min(v31,v32)+abs(v31-v32)/(900-500)*(L-500);
        v=min(v01,v02)+abs(v01-v02)*(miu-100)/(200-100);
    elseif L<=1300
        v01=min(v22,v23)+abs(v22-v23)/(1300-900)*(L-900);
        v02=min(v32,v33)+abs(v32-v33)/(1300-900)*(L-900);
        v=min(v01,v02)+abs(v01-v02)*(miu-100)/(200-100);
    elseif L<=2000
        v01=min(v23,v24)+abs(v23-v24)/(2000-1300)*(L-1300);
        v02=min(v33,v34)+abs(v33-v34)/(2000-1300)*(L-1300);
        v=min(v01,v02)+abs(v01-v02)*(miu-100)/(200-100);
    elseif L<=3000
        v01=min(v24,v25)+abs(v24-v25)/(3000-2000)*(L-2000);
        v02=min(v34,v35)+abs(v34-v35)/(3000-2000)*(L-2000);
        v=min(v01,v02)+abs(v01-v02)*(miu-100)/(200-100);
    else
        v01=v25;
        v02=v35;
        v=min(v01,v02)+abs(v01-v02)*(miu-100)/(200-100);
    end
end

if miu>200&&miu<=400
    if L<=500
        v01=v31;
        v02=v41;
        v=min(v01,v02)+abs(v01-v02)*(miu-200)/(400-200);
    elseif L<=900
        v01=min(v31,v32)+abs(v31-v32)/(900-500)*(L-500);
        v02=min(v41,v42)+abs(v41-v42)/(900-500)*(L-500);
        v=min(v01,v02)+abs(v01-v02)*(miu-200)/(400-200);
    elseif L<=1300
        v01=min(v32,v33)+abs(v32-v33)/(1300-900)*(L-900);
        v02=min(v42,v43)+abs(v42-v43)/(1300-900)*(L-900);
        v=min(v01,v02)+abs(v01-v02)*(miu-200)/(400-200);
    elseif L<=2000
        v01=min(v33,v34)+abs(v33-v34)/(2000-1300)*(L-1300);
        v02=min(v43,v44)+abs(v43-v44)/(2000-1300)*(L-1300);
        v=min(v01,v02)+abs(v01-v02)*(miu-200)/(400-200); 
    elseif L<=3000
        v01=min(v34,v35)+abs(v34-v35)/(3000-2000)*(L-2000);
        v02=min(v44,v45)+abs(v44-v45)/(3000-2000)*(L-2000);
        v=min(v01,v02)+abs(v01-v02)*(miu-200)/(400-200);
    else
        v01=v35;
        v02=v45;
        v=min(v01,v02)+abs(v01-v02)*(miu-200)/(400-200);
    end
end
if miu>400&&miu<=730
    if L<=500
        v01=v41;
        v02=v51;
        v=min(v01,v02)+abs(v01-v02)*(miu-400)/(730-400);
    elseif L<=900
        v01=min(v41,v42)+abs(v41-v42)/(900-500)*(L-500);
        v02=min(v51,v52)+abs(v51-v52)/(900-500)*(L-500);
        v=min(v01,v02)+abs(v01-v02)*(miu-400)/(730-400);
    elseif L<=1300
        v01=min(v42,v43)+abs(v42-v43)/(1300-900)*(L-900);
        v02=min(v52,v53)+abs(v52-v53)/(1300-900)*(L-900);
        v=min(v01,v02)+abs(v01-v02)*(miu-400)/(730-400);
    elseif L<=2000
        v01=min(v43,v44)+abs(v43-v44)/(2000-1300)*(L-1300);
        v02=min(v53,v54)+abs(v53-v54)/(2000-1300)*(L-1300);
        v=min(v01,v02)+abs(v01-v02)*(miu-400)/(730-400);
    elseif L<=3000
        v01=min(v44,v45)+abs(v44-v45)/(3000-2000)*(L-2000);
        v02=min(v54,v55)+abs(v54-v55)/(3000-2000)*(L-2000);
        v=min(v01,v02)+abs(v01-v02)*(miu-400)/(730-400);
    else
        v01=v45;
        v02=v55;
        v=min(v01,v02)+abs(v01-v02)*(miu-400)/(730-400);
    end
end

if miu>730&&miu<=1000
    if L<=500
        v01=v51;
        v02=v61;
        v=min(v01,v02)+abs(v01-v02)*(miu-730)/(1000-730);
    elseif L<=900
        v01=min(v51,v52)+abs(v51-v52)/(900-500)*(L-500);
        v02=min(v61,v62)+abs(v61-v62)/(900-500)*(L-500);
        v=min(v01,v02)+abs(v01-v02)*(miu-730)/(1000-730);
    elseif L<=1300
        v01=min(v52,v53)+abs(v52-v53)/(1300-900)*(L-900);
        v02=min(v62,v63)+abs(v62-v63)/(1300-900)*(L-900);
        v=min(v01,v02)+abs(v01-v02)*(miu-730)/(1000-730);
    elseif L<=2000
        v01=min(v53,v54)+abs(v53-v54)/(2000-1300)*(L-1300);
        v02=min(v63,v64)+abs(v63-v64)/(2000-1300)*(L-1300);
        v=min(v01,v02)+abs(v01-v02)*(miu-730)/(1000-730);
    elseif L<=3000
        v01=min(v54,v55)+abs(v54-v55)/(3000-2000)*(L-2000);
        v02=min(v64,v65)+abs(v64-v65)/(3000-2000)*(L-2000);
        v=min(v01,v02)+abs(v01-v02)*(miu-730)/(1000-730);
    else
        v01=v55;
        v02=v65;
        v=min(v01,v02)+abs(v01-v02)*(miu-730)/(1000-730);
    end
end

if miu>1000
    if L<=500
        v=v61;
    elseif L<=900
        v=v61+(v62-v61)/(900-500)*(L-500);
    elseif L<=1300
        v=v62+(v63-v62)/(900-1300)*(L-1300);
    elseif L<=2000
        v=v63+(v64-v63)/(2000-1300)*(L-1300);
    elseif L<=3000
        v=v64+(v65-v64)/(3000-2000)*(L-2000);
    else 
        v=v65;
    end
end
end 
function [M_re]=NiuJu(m,Ma)
    if m>0.9
        M_re=Ma;
    elseif m>0.7
        M_re=0.82*Ma;
    elseif m>0.5
        M_re=0.5*Ma;
    elseif m>0.2
        M_re=1/9*Ma;
    elseif m>0.1
        M_re=1/20*Ma;
    else
        M_re=0*Ma;
    end
end